//ใช้เป็น JS OBJECT
let dataTR = [
    {
        /*"number": 0,*/
        "NameCard": "The Fool",
        "dataWork": "การงาน: อาจมีเกณฑ์ได้เริ่มต้นกิจการใหม่ๆหรือหมายถึงการเบื่อๆเรื่องงานอยากไปพักร้อน",
        "dataFinance": "การเงิน: ภาวะทางการเงินจะไม่แน่นอนคาดหวังความสม่ำเสมอไม่ได้",
        "dataLove": "ความรัก: อาจยังต้องการอิสระในชีวิตอยู่ หรือมีเกณฑ์เกี่ยวข้องกับคนเจ้าชู้ รักอิสระ",
        "dataHealth": "สุขภาพ: ระวังเกี่ยวกับระบบความดันโลหิต",
        "pic": "./pic/TheFool.jpg"
    },
    {
        /*"number": I,*/
        "NameCard": "The Magician",
        "dataWork": "การงาน: เหมาะกับงานที่เกี่ยวข้องกับคนจำนวนมากๆเช่นพิธีกร ดีเจ วีเจ งานการสอนก็ดี เพราะสามารถสื่อให้คนเข้าใจได้ง่าย หรือทำงานไม่ตรงกับสายที่เรียนมา",
        "dataFinance": "การเงิน: จะมีสภาพการเงินที่ดีขึ้น ส่วนใหญ่ตามที่ดูมา จะไม่ดีมาก แต่ก็ไม่แย่ หากเงินหมดก็สามารถหามาได้ทัน",
        "dataLove": "การเงิน: จะมีสภาพการเงินที่ดีขึ้น ส่วนใหญ่ตามที่ดูมา จะไม่ดีมาก แต่ก็ไม่แย่ หากเงินหมดก็สามารถหามาได้ทัน",
        "dataHealth": "สุขภาพ: ระวังระบบทางเดินหายใจและระบบปลายประสาทอักเสบ",
        "pic": "./pic/TheMagician.jpg"
    },
    {
        /*"number": II,*/
        "NameCard": "The High Priestress",
        "dataWork": "การงาน: ธุรกิจจะดำเนินไปอย่างเชื่องช้าในระยะแรก อาชีพที่เหมาะสมคือศิลปินทุกรูปแบบหรืองานพวกการสืบสวนก็ได้",
        "dataFinance": "การเงิน: การเงินจะมาแบบช้าๆ ต้องอาศัยความอดทนสักหน่อย",
        "dataLove": "ความรัก: หากเป็นผู้ชายอาจได้พบกับคนที่ถูกใจ ส่วนหากเป็นผู้หญิงอาจจะหมายถึงรักข้างเดียวหรือรักซ้อนก็ได้",
        "dataHealth": "สุขภาพ: เนื่องจากไพ่ใบนี้เกี่ยวกับธาตุน้ำ จึงควรระมัดระวังระบบการย่อยอาหาร ไต หรือระบบปัสสาวะ",
        "pic": "./pic/TheHighPriestress.jpg"
    },
    {
        /*"number": III,*/
        "NameCard": "The Empress",
        "dataWork": "การงาน: ถ้าจะค้าขายก็เหมาะของสวยๆงามๆหรือไม่ก็พวกอิเล็กโทรนิคไปเลย ส่วนงานยังไม่เสร็จตามกำหนดต้องแก้ไขปรับปรุง",
        "dataFinance": "การเงิน: ได้แน่นอนแต่ช้า การทวงหนี้ไม่โกงแต่คุณได้ช้า หากจะขอความช่วยเหลือก็เป็นเพศหญิงที่ขาวๆรูปร่างอวบๆ ดีกว่า",
        "dataLove": "ความรัก: เป็นไพ่ของความสมหวัง อาจลงท้ายด้วยการแต่งงาน หรือหมายถึง การมีเพศสัมพันธ์ที่เกิดจากความรัก การตั้งครรภ์ หรือมีการหึงหวงถ้ามีไพ่ 7 ดาบมาประกบติดล่ะก็หึงจนน่ารำคาญเลยเชียว",
        "dataHealth": "สุขภาพ: ระวังเกี่ยวกับระบบการสืบพันธุ์เช่นมดลูก",
        "pic": "./pic/TheEmpress.jpg"
    },
    {
        /*"number": IV,*/
        "NameCard": "The Emperor",
        "dataWork": "การงาน: บริษัทโครงสร้างองค์กรขนาดใหญ่หรืองานที่เกี่ยวพันกับคนต่างชาติ แต่ลักษณะงานที่ถูกโฉลกจะเกี่ยวกับวิทยาศาสตร์ เทคโนโลยีสมัยใหม่ การเมือง ราชการ ถ้ามีการเจรจา แบ่งผลประโยชน์ จะเป็นไปอย่างราบรื่น",
        "dataFinance": "การเงิน: ควรระมัดระวังการใช้จ่ายอย่างฟุ่มเฟือย เงินจึงมักขาดมือแต่ว่าสามารถหามาได้ทันกัน",
        "dataLove": "ความรัก: สำหรับผู้หญิงที่หยิบได้ไพ่ใบนี้ อาจได้พบรักกับชายอายุมากกว่าหรือเป็นคนต่างชาติ  หรือเข้าสังคมมากขึ้น เจอผู้คนใหม่ๆมากขึ้น",
        "dataHealth": "สุขภาพ: อาจมีอาการปวดหัวได้ง่าย",
        "pic": "./pic/TheEmperor.jpg"
    },
    {
        /*"number": V,*/
        "NameCard": "The Hierophant",
        "dataWork": "การงาน: อาจจะมีปัญหาจุกจิกๆ ในงาน หรือมีคนจุกจิกใส่คุณ",
        "dataFinance": "การเงิน: คุณจะวางแผนการเงินใหม่แต่อย่าเคร่งครัดมาก ถ้าหากตบะแตกขึ้นมาเงินเก็บจะพลอดหดหายไปด้วย",
        "dataLove": "ความรัก: หากผู้หญิงเปิดได้ไพ่ใบนี้หมายถึง ได้แต่งงานช้าหรือคู่อายุแก่กว่ามาก และหากได้แต่งก็จะทำพิธีอย่างถูกต้องตามประเพณี",
        "dataHealth": "สุขภาพ: ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ",
        "pic": "./pic/TheHierophant.jpg"
    },
    {
        /*"number": VI,*/
        "NameCard": "The Lover",
        "dataWork": "การงาน: อาจจะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดีหรือคุณจะมีทางสายใหม่ที่ดีกว่าเดิมให้ทำ",
        "dataFinance": "การเงิน: การเงินสามารถหามาได้เรื่อยๆ แบบสบายๆ",
        "dataLove": "ความรัก: ไม่ต้องสงสัยเลยว่าคุณกำลังอยู่ในช่วงกำลังมีความรัก อย่าเฉื่อยชาหรือกระตือรือล้นจนเกินไป หากเป็นคนโสด ก็จะพบรักในเวลาไม่นานนัก",
        "dataHealth": "สุขภาพ: ระวังพวกลมในกระเพาะอาหาร การจุกเสียด",
        "pic": "./pic/TheLover.jpg"
    },
    {
        /*"number": VII,*/
        "NameCard": "The Chariot",
        "dataWork": "การงาน: เหมาะกับงานที่เกี่ยวกับการขนส่งทุกชนิด การเป็น สจ๊วต หรือ แอร์ มักจะได้ไพ่ใบนี้ หรือการจะหมายถึงการทำงานกับคนต่างชาติ ต้องใช้ภาษาต่างต่างประเทศก็ได้",
        "dataFinance": "การเงิน: ต้องเผชิญปัญหาการเงิน แต่ก็สามารถผ่านพ้นมาได้ ต้องมีการโต้เถียง หรือขัดแย้งกัน จึงจะได้เงินนั้นมา",
        "dataLove": "ความรัก: คนโสด คุณอาจพบรักกับคนแปลกหน้า คนที่มีคนรักแล้วอาจจะมีปัญหาจำเป็นต้องแยกกันสักพักและกลับมาคืนดีกัน",
        "dataHealth": "สุขภาพ: มักเกี่ยวกับระบบการย่อยการขับถ่ายไม่ดี",
        "pic": "./pic/TheChariot.jpg"
    },
    {
        /*"number": VIII,*/
        "NameCard": "The Strength",
        "dataWork": "การงาน: คุณอาจจะได้รับรางวัลแห่งความสำเร็จในความเพียร หรืองานเกี่ยวกับการดูแลความงามก็ได้",
        "dataFinance": "การเงิน: เงินที่คาดหวังไว้จะได้มา ความยุ่งยากทางการเงินจะได้รับการแก้ไข",
        "dataLove": "ความรัก: หากคุณเพิ่งพบใครบางคน เวลาจะเป็นตัวช่วยให้ความรักของคุณมั่นคงขึ้น ในรายที่ไม่มีแฟน คุณยังไม่พร้อมที่จะรักใครเนื่องจากยังอาวรณ์กับความหลัง",
        "dataHealth": "สุขภาพ: หมายความได้สองอย่างคือ แข็งแรงมาก หรือฟื้นตัวจากการไม่สบาย",
        "pic": "./pic/Strength.jpg"
    },
    {
        /*"number": IX,*/
        "NameCard": "The Hermit",
        "dataWork": "การงาน: งานที่ทำเหมาะกับโครงการระยะยาว หากถามถึงงานที่ทำอยู่ ก็มักจะได้ดีในภายหลัง ถ้ากล่าวถึงอาชีพ เหมาะกับ แพทย์ อาจารย์ นักเขียน นักวิชาการ",
        "dataFinance": "การเงิน: เงินที่เข้ามาเป็นระลอก มีมากพอที่จะจ่ายลงไป",
        "dataLove": "ความรัก: เป็นช่วงเวลาที่อยู่ตามลำพัง รู้สึกเหงา ไม่มีใคร หรือหมายถึงการได้แต่งงานเมื่ออายุมากแล้วและรวมทั้งถ่านไฟเกิดคุขึ้นมาอีก คนรักเก่าอาจกลับเข้ามาสู่ชีวิตคุณอีกครั้งหนึ่ง",
        "dataHealth": "สุขภาพ: อาการเหมือนโรคซึมเศร้า",
        "pic": "./pic/TheHermit.jpg"
    },
    {
        /*"number": X,*/
        "NameCard": "The Wheel of Fortune",
        "dataWork": "การงาน: เจ้าชะตายังไม่พอใจกับเรื่องของงานมากนัก อยากจะทำให้ดีกว่าเดิม หมายถึงทำงานเกี่ยวกับด้านบ้านและที่ดินก็ได้",
        "dataFinance": "การเงิน: การเงินจะมีพอเข้ามาให้ใช้จ่ายทำให้ไม่กังวลใจมากนัก",
        "dataLove": "ความรัก: หากมีความสัมพันธ์อยู่แล้วหมายถึงการคบกันสบายๆไม่หึงหวงซึ่งกันและกัน และอาจจะมีคนรักเก่ากลับเข้ามาในชีวิตอีกครั้งหนึ่ง ในคนโสด มีแนวโน้มว่า จะได้พบใครสักคนจากการทำกิจกรรมหรือจากคำแนะนำของเพื่อน",
        "dataHealth": "สุขภาพ: ระวังโรคในช่องท้อง พวกกระเพาะอาหาร ตับ ไต",
        "pic": "./pic/WheelofFortune.jpg"
    },
    {
        /*"number": XI,*/
        "NameCard": "Justice",
        "dataWork": "การงาน: ในการทำงานจะได้รับความยุติธรรมจากคนรอบข้าง",
        "dataFinance": "การเงิน: สถานะการเงินเป็นแบบมาเร็วไปเร็ว",
        "dataLove": "ความรัก: จากประสบการณ์แล้วหากมีเพศตรงข้ามเข้าเกี่ยวข้อง ต้องระวังให้มากเค้าจะแค่หลงอยู่พักหนึ่งแล้วก็จะจากไป",
        "dataHealth": "สุขภาพ: ส่วนใหญ่จะไม่ค่อยเจ็บป่วย",
        "pic": "./pic/Justice.jpg"
    },
    {
        /*"number": XII,*/
        "NameCard": "The Hanged Man",
        "dataWork": "การงาน: เป็นช่วงที่ต้องมีความอดทนกับสภาวะการงานที่ทำอยู่ ธุรกิจที่ทำอยู่ เริ่มส่อเค้าปัญหา",
        "dataFinance": "การเงิน: จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน",
        "dataLove": " ความรัก: หากเป็นคนโสด หมายถึง มีความโหยหาในเรื่องความรัก มีความอ่อนไหว หากเพิ่งเริ่มคบกัน อย่างเพิ่งเทใจ",
        "dataHealth": "สุขภาพ: หมายถึงโรคเบาหวาน ในหญิงควรระวังเกี่ยวกับมดลูกด้วย",
        "pic": "./pic/TheHangedMan.jpg"
    },
    {
        /*"number": XII,*/
        "NameCard": "Death",
        "dataWork": "การงาน: อาจมีความล้มเหลว ผิดหวัง หุ้นส่วนแตกคอกัน",
        "dataFinance": "การเงิน: รายได้ค่อนข้างแย่มาก รายได้ตกลงอย่างเห็นได้ชัด ต้องระวังเงินหาย หรือโดนล้วงกระเป๋า",
        "dataLove": "ความรัก: หากมีคนรักจะมีปัญหา จนอาจเลิกกันได้ ในคนโสด จะพบกับคนที่น่าหลงใหลอย่างมาก",
        "dataHealth": " สุขภาพ: ระวังอาการเจ็บป่วย เข้าโรงพยาบาลกระทันหัน",
        "pic": "./pic/Death.jpg"
    },
    {
        /*"number": XIV,*/
        "NameCard": "Temperance",
        "dataWork": "การงาน: มีโอกาสย้ายงาน หรือออกจากงานค่อนข้างสูง หากเปิดได้ในขณะทำนายภาวะปัจจุบัน มีการเดินทางไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ",
        "dataFinance": "การเงิน: มีการหมุนเงินเยอะมากในช่วงนี้",
        "dataLove": "ความรัก: หากกำลังมีปัญหากับคนรักอาจต้องการเลิกรา ที่เลิกก็จะกลับมารักกัน คนโสด มีเกณฑ์ได้รู้จักกับคนที่ผ่านการแนะนำของเพื่อน",
        "dataHealth": "สุขภาพ: การทำงานโดยไม่หยุดพัก อาจทำให้ร่างกายอ่อนแอ",
        "pic": "./pic/Temperance.jpg"
    },
    {
        /*"number": XV,*/
        "NameCard": "The Devil",
        "dataWork": "การงาน: ไพ่ใบนี้จะให้ผลดีกับผู้ที่ทำงานเกี่ยวกับอบายมุขทั้งปวง เช่น เปิดบ่อน ขายเหล้า เบียร์ เปิดผับ บาร์ อาบอบนวด เป็นต้น หากเป็นคนทำงานปกติทั่วไป มักจะมีงาน Part time เข้ามา",
        "dataFinance": "การเงิน: หมายถึงการทำงานหนักมาก หากทำธุรกิจของตนเอง จะได้กำไรน้อยมาก ไม่สมกับที่ลงแรงทำลงไป",
        "dataLove": "ความรัก: จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ ภายหลังจากความปรารถนาอันแรงกล้าผ่านไปแล้ว อาจพบว่าไม่มีอะไรเหมือนกันเลยทำให้ต้องเลิกกันไป",
        "dataHealth": "สุขภาพ: มีโอกาสเป็นเกี่ยวกับโรคทางเพศสัมพันธ์",
        "pic": "./pic/TheDevil.jpg"
    },
    {
        /*"number": XVI,*/
        "NameCard": "The Tower",
        "dataWork": "การงาน: สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังทลายลงอย่างไม่คาดคิด ปัญหามักจะเกิดกะทันหันโดยไม่ทันตั้งตัว",
        "dataFinance": "การเงิน: จะเกิดการสูญเสียเงิน หรือเสียเงินก้อนโตนับตั้งแต่ที่เคยเสียมา",
        "dataLove": "ความรัก: อาจจะอกหัก หรือมีการหย่าร้างเกิดขึ้น หากเป็นคนโสดและมีไพ่ความรักที่ดีใบอื่นประกบอยู่หมายถึงจะพบรักกะทันหัน",
        "dataHealth": "สุขภาพ: ระวังการเจ็บป่วยแบบกระทันหันหรืออุบัติเหตุ",
        "pic": "./pic/TheTower.jpg"
    },
    {
        /*"number": XVII,*/
        "NameCard": "The Star",
        "dataWork": " การงาน: ต้องการปรับปรุงให้ดีขึ้นต่อไป งานที่เกี่ยวข้องกับความสวยงาม ศิลปะจะดีมาก รวมถึงงานก่อสร้างบ้านเรือน วัสดุก่อสร้าง หรือของตกแต่งบ้านก็ได้",
        "dataFinance": "การเงิน: คาดการณ์สิ่งใดเกี่ยวกับการเงินไว้มักจะได้ตามที่คาด",
        "dataLove": " ความรัก: ส่วนใหญ่ผู้ที่ได้มักเป็นโสด โดยใช้เวลาส่วนใหญ่กับเพื่อนฝูง",
        "dataHealth": "สุขภาพ: เมื่อไพ่ใบนี้ปรากฏมักเป็นข่าวดี มักเป็นการฟื้นตัวจากความเจ็บป่วย",
        "pic": "./pic/TheStar.jpg"
    },
    {
        /*"number": XVII,*/
        "NameCard": "The Moon",
        "dataWork": "การงาน: อย่าวู่วาม ต้องควบคุมอารมณ์อย่างมาก อาจมีคนกลั่นแกล้งในงานระมัดระวังปัญหาเกี่ยวกับเอกสารต่างๆ ให้ดี",
        "dataFinance": "การเงิน: ต้องระมัดระวังอาจถูกโกงเงินหุ้นส่วนเอาเปรียบ ระมัดระวังด้านเอกสารให้ดี",
        "dataLove": "ความรัก: หากมีคนรักแล้ว อาจถูกคนรักหลอกลวงอยู่ หากเป็นคนโสด หมายถึง คนกำลังโหยหาความรักอย่างมาก",
        "dataHealth": "สุขภาพ: ระวังระบบเลือด น้ำเหลือง และมดลูกไม่ดี",
        "pic": "./pic/TheMoon.jpg"
    },
    {
        /*"number": XIX,*/
        "NameCard": "The Sun",
        "dataWork": "การงาน: จะได้งานใหม่หากตกงานอยู่ ธุรกิจส่วนตัวจะคล่องตัวขึ้นการติดต่อการงานกับผู้ใหญ่ จะเป็นไปอย่างราบรื่น",
        "dataFinance": "การเงิน: หากรอข่าวใดอยู่ จะได้รับข่าวดี มักจะมีชื่อเสียงในการทำงานก่อน เงินจึงจะได้รับตามมาภายหลัง",
        "dataLove": "ความรัก: จะได้คู่ที่ดี ช่วยส่งเสริมกันและกันให้เจริญรุ่งเรือง หากยังไม่มีคนรักก็จะมีเข้ามา",
        "dataHealth": "สุขภาพ: โดยส่วนมากแข็งแรง แต่ควรระวังเรื่องความดันโลหิตไว้บ้าง",
        "pic": "./pic/TheSun.jpg"
    },
    {
        /*"number": XX,*/
        "NameCard": "Judgement",
        "dataWork": "การงาน: หากเพิ่งลาออกจากงานก็จะได้งานใหม่ในเวลาไม่นานนัก จากประสบการณ์มักจะได้งานจากเพื่อนฝูงบอกต่อมาให้มา",
        "dataFinance": "การเงิน: จะเห็นได้ชัดว่า เริ่มมีการเปลี่ยนแปลงในทางที่ดีขึ้น เรื่องการเงิน หากลงทุนอะไรลงไปก็จะได้รับผลตอบแทนค่อนข้างดี",
        "dataLove": "ความรัก: มีเรื่องที่ต้องตัดสินใจ เนื่องจากคนรักเก่าได้หวนกลับมา",
        "dataHealth": "สุขภาพ: มักฟื้นตัว แต่ถ้าป่วยก็มักเป็นโรคเดิมที่เคยป่วย",
        "pic": "./pic/Judgement.jpg"
    },
    {
        /*"number": XXI,*/
        "NameCard": "The World",
        "dataWork": "การงาน: งานที่ทำมานานจะประสบความสำเร็จตามที่หวังโดยเฉพาะในสายงานศิลปะงานพวกนายหน้าขายที่ดินก็ดีเช่นกัน",
        "dataFinance": "การเงิน: เงินจะมาจากหลายๆ ทาง ส่วนใหญ่ จะมาจากสิ่งที่คุณทำมาแล้วเป็นระยะเวลานาน",
        "dataLove": "ความรัก: หากมีคนรักอยู่ ถือว่าเป็นความสัมพันธ์ที่ดี",
        "dataHealth": "สุขภาพ: สุขภาพแข็งแรง",
        "pic": "./pic/TheWorld.jpg"
    },
    
    
]
let size = dataTR.length;